In [7]:
import numpy as np

In [2]:
import pandas as pd

In [14]:
s = [1, 3, 5, np.nan, 6, 8]

In [15]:
s

[1, 3, 5, nan, 6, 8]

In [3]:
dates = pd.date_range("20130101", periods=6)

In [17]:
dates

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [18]:
df = pd.DataFrame(np.random.randn(6, 4), index=dates, columns=list("ABCD"))

In [19]:
df

                   A         B         C         D
2013-01-01 -0.658770  0.835645 -1.982701 -0.988242
2013-01-02 -1.508095  0.113650 -1.996918 -1.424770
2013-01-03  0.336551  1.684676 -0.364824 -1.327926
2013-01-04  0.038840 -0.517081 -0.205679 -1.243632
2013-01-05 -1.549272  1.780159 -0.165673  1.451983
2013-01-06 -1.954771  1.354079 -0.023719  0.893566

In [20]:
df2 = pd.DataFrame({
    "A":1.0,
    "B":pd.Timestamp("20130102"),
    "C":pd.Series(1, index= list(range(4)), dtype="float32"),
    "D":np.array([3] * 4, dtype="int32"),
    "E":pd.Categorical(["test", "train", "test", "train"]),
    "F":"foo"
})

In [21]:
df2

     A          B    C  D      E    F
0  1.0 2013-01-02  1.0  3   test  foo
1  1.0 2013-01-02  1.0  3  train  foo
2  1.0 2013-01-02  1.0  3   test  foo
3  1.0 2013-01-02  1.0  3  train  foo

In [22]:
df2.dtypes

A          float64
B    datetime64[s]
C          float32
D            int32
E         category
F           object
dtype: object

In [23]:
df.tail()

                   A         B         C         D
2013-01-02 -1.508095  0.113650 -1.996918 -1.424770
2013-01-03  0.336551  1.684676 -0.364824 -1.327926
2013-01-04  0.038840 -0.517081 -0.205679 -1.243632
2013-01-05 -1.549272  1.780159 -0.165673  1.451983
2013-01-06 -1.954771  1.354079 -0.023719  0.893566

In [24]:
df.head()

                   A         B         C         D
2013-01-01 -0.658770  0.835645 -1.982701 -0.988242
2013-01-02 -1.508095  0.113650 -1.996918 -1.424770
2013-01-03  0.336551  1.684676 -0.364824 -1.327926
2013-01-04  0.038840 -0.517081 -0.205679 -1.243632
2013-01-05 -1.549272  1.780159 -0.165673  1.451983

In [25]:
df.index

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [26]:
df.columns

Index(['A', 'B', 'C', 'D'], dtype='object')

In [27]:
df.to_numpy()

array([[-0.65876994,  0.83564506, -1.98270052, -0.98824219],
       [-1.50809482,  0.11365027, -1.99691783, -1.42477021],
       [ 0.33655082,  1.68467563, -0.36482442, -1.32792648],
       [ 0.03884048, -0.51708133, -0.205679  , -1.24363152],
       [-1.54927185,  1.78015867, -0.16567261,  1.45198264],
       [-1.95477076,  1.35407947, -0.02371946,  0.89356583]])

In [28]:
df2.dtypes

A          float64
B    datetime64[s]
C          float32
D            int32
E         category
F           object
dtype: object

In [29]:
df2.to_numpy()

array([[1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'test', 'foo'],
       [1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'train', 'foo'],
       [1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'test', 'foo'],
       [1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'train', 'foo']],
      dtype=object)

In [30]:
df.describe()

              A         B         C         D
count  6.000000  6.000000  6.000000  6.000000
mean  -0.882586  0.875188 -0.789919 -0.439837
std    0.934957  0.919075  0.935774  1.269848
min   -1.954771 -0.517081 -1.996918 -1.424770
25%   -1.538978  0.294149 -1.578231 -1.306853
50%   -1.083432  1.094862 -0.285252 -1.115937
75%   -0.135562  1.602027 -0.175674  0.423114
max    0.336551  1.780159 -0.023719  1.451983

In [31]:
df.T

   2013-01-01  2013-01-02  2013-01-03  2013-01-04  2013-01-05  2013-01-06
A   -0.658770   -1.508095    0.336551    0.038840   -1.549272   -1.954771
B    0.835645    0.113650    1.684676   -0.517081    1.780159    1.354079
C   -1.982701   -1.996918   -0.364824   -0.205679   -0.165673   -0.023719
D   -0.988242   -1.424770   -1.327926   -1.243632    1.451983    0.893566

In [32]:
df.sort_index(axis = 1, ascending=False)

                   D         C         B         A
2013-01-01 -0.988242 -1.982701  0.835645 -0.658770
2013-01-02 -1.424770 -1.996918  0.113650 -1.508095
2013-01-03 -1.327926 -0.364824  1.684676  0.336551
2013-01-04 -1.243632 -0.205679 -0.517081  0.038840
2013-01-05  1.451983 -0.165673  1.780159 -1.549272
2013-01-06  0.893566 -0.023719  1.354079 -1.954771

In [33]:
df

                   A         B         C         D
2013-01-01 -0.658770  0.835645 -1.982701 -0.988242
2013-01-02 -1.508095  0.113650 -1.996918 -1.424770
2013-01-03  0.336551  1.684676 -0.364824 -1.327926
2013-01-04  0.038840 -0.517081 -0.205679 -1.243632
2013-01-05 -1.549272  1.780159 -0.165673  1.451983
2013-01-06 -1.954771  1.354079 -0.023719  0.893566

In [34]:
df.sort_index(axis=0, ascending=False)

                   A         B         C         D
2013-01-06 -1.954771  1.354079 -0.023719  0.893566
2013-01-05 -1.549272  1.780159 -0.165673  1.451983
2013-01-04  0.038840 -0.517081 -0.205679 -1.243632
2013-01-03  0.336551  1.684676 -0.364824 -1.327926
2013-01-02 -1.508095  0.113650 -1.996918 -1.424770
2013-01-01 -0.658770  0.835645 -1.982701 -0.988242

In [35]:
df.sort_values(by="B")

                   A         B         C         D
2013-01-04  0.038840 -0.517081 -0.205679 -1.243632
2013-01-02 -1.508095  0.113650 -1.996918 -1.424770
2013-01-01 -0.658770  0.835645 -1.982701 -0.988242
2013-01-06 -1.954771  1.354079 -0.023719  0.893566
2013-01-03  0.336551  1.684676 -0.364824 -1.327926
2013-01-05 -1.549272  1.780159 -0.165673  1.451983

In [36]:
df["A"]

2013-01-01   -0.658770
2013-01-02   -1.508095
2013-01-03    0.336551
2013-01-04    0.038840
2013-01-05   -1.549272
2013-01-06   -1.954771
Freq: D, Name: A, dtype: float64

In [37]:
df[0:0]

Empty DataFrame
Columns: [A, B, C, D]
Index: []

In [38]:
df[0:1]

                  A         B         C         D
2013-01-01 -0.65877  0.835645 -1.982701 -0.988242

In [39]:
df[0:2]

                   A         B         C         D
2013-01-01 -0.658770  0.835645 -1.982701 -0.988242
2013-01-02 -1.508095  0.113650 -1.996918 -1.424770

In [40]:
df[0:3]

                   A         B         C         D
2013-01-01 -0.658770  0.835645 -1.982701 -0.988242
2013-01-02 -1.508095  0.113650 -1.996918 -1.424770
2013-01-03  0.336551  1.684676 -0.364824 -1.327926

In [41]:
df['20130102':'20130104']

                   A         B         C         D
2013-01-02 -1.508095  0.113650 -1.996918 -1.424770
2013-01-03  0.336551  1.684676 -0.364824 -1.327926
2013-01-04  0.038840 -0.517081 -0.205679 -1.243632

In [51]:
df.loc[dates[0]]

A   -0.658770
B    0.835645
C   -1.982701
D   -0.988242
Name: 2013-01-01 00:00:00, dtype: float64

In [52]:
df.loc[:, ["A", "B"]] #Selecting all rows (:) with a select column labels:

                   A         B
2013-01-01 -0.658770  0.835645
2013-01-02 -1.508095  0.113650
2013-01-03  0.336551  1.684676
2013-01-04  0.038840 -0.517081
2013-01-05 -1.549272  1.780159
2013-01-06 -1.954771  1.354079

In [48]:
df.loc["20130102":"20130104", ["A", "B"]] # For label slicing, both endpoints are included:

                   A         B
2013-01-02 -1.508095  0.113650
2013-01-03  0.336551  1.684676
2013-01-04  0.038840 -0.517081

In [50]:
df.loc[dates[0], "A"] #Selecting a single row and column label returns a scalar:

np.float64(-0.6587699390669937)

In [53]:
df.at[dates[0], "A"] #For getting fast access to a scalar (equivalent to the prior method):

np.float64(-0.6587699390669937)

In [56]:
df.iloc[3] #Select via the position of the passed integers:

A    0.038840
B   -0.517081
C   -0.205679
D   -1.243632
Name: 2013-01-04 00:00:00, dtype: float64

In [58]:
df.iloc[3:5, 0:2] #Integer slices acts similar to NumPy/Python:

                   A         B
2013-01-04  0.038840 -0.517081
2013-01-05 -1.549272  1.780159

In [60]:
df.iloc[[1,2,4], [0, 2]] #Lists of integer position locations:

                   A         C
2013-01-02 -1.508095 -1.996918
2013-01-03  0.336551 -0.364824
2013-01-05 -1.549272 -0.165673

In [61]:
df.iloc[1:3, :] #For slicing rows explicitly

                   A         B         C         D
2013-01-02 -1.508095  0.113650 -1.996918 -1.424770
2013-01-03  0.336551  1.684676 -0.364824 -1.327926

In [62]:
df.iloc[:, 1:3] #For slicing columns explicitly:

                   B         C
2013-01-01  0.835645 -1.982701
2013-01-02  0.113650 -1.996918
2013-01-03  1.684676 -0.364824
2013-01-04 -0.517081 -0.205679
2013-01-05  1.780159 -0.165673
2013-01-06  1.354079 -0.023719

In [64]:
df.iloc[1, 1] #For getting a value explicitly

np.float64(0.11365027395097477)

In [69]:
df.iat[1 ,1] # For getting fast access to a scalar # --equivalent to the prior method

np.float64(0.11365027395097477)

In [70]:
# Boolean indexing

In [72]:
df[df["A"] > 0] #Select rows where df.A is greater than 0.

                   A         B         C         D
2013-01-03  0.336551  1.684676 -0.364824 -1.327926
2013-01-04  0.038840 -0.517081 -0.205679 -1.243632

In [73]:
df[df > 0] #Selecting values from a DataFrame where a boolean condition is met:

                   A         B   C         D
2013-01-01       NaN  0.835645 NaN       NaN
2013-01-02       NaN  0.113650 NaN       NaN
2013-01-03  0.336551  1.684676 NaN       NaN
2013-01-04  0.038840       NaN NaN       NaN
2013-01-05       NaN  1.780159 NaN  1.451983
2013-01-06       NaN  1.354079 NaN  0.893566

In [74]:
# Using isin() method for filtering:

In [75]:
df2 = df.copy()

In [76]:
df2["E"] = ["one", "one", "two","three", "four", "three"]

In [77]:
df2

                   A         B         C         D      E
2013-01-01 -0.658770  0.835645 -1.982701 -0.988242    one
2013-01-02 -1.508095  0.113650 -1.996918 -1.424770    one
2013-01-03  0.336551  1.684676 -0.364824 -1.327926    two
2013-01-04  0.038840 -0.517081 -0.205679 -1.243632  three
2013-01-05 -1.549272  1.780159 -0.165673  1.451983   four
2013-01-06 -1.954771  1.354079 -0.023719  0.893566  three

In [80]:
df2[df2["E"].isin(["two", "four"])]

                   A         B         C         D     E
2013-01-03  0.336551  1.684676 -0.364824 -1.327926   two
2013-01-05 -1.549272  1.780159 -0.165673  1.451983  four

In [84]:
# Settings

In [88]:
# Setting a new column automatically aligns the data by the indexes:

In [83]:
s1 = pd.Series([1, 2, 3, 4, 5, 6], index=pd.date_range("20130102", periods=6))

In [85]:
s1

2013-01-02    1
2013-01-03    2
2013-01-04    3
2013-01-05    4
2013-01-06    5
2013-01-07    6
Freq: D, dtype: int64

In [87]:
df["F" ]= s1

In [89]:
df

                   A         B         C         D    F
2013-01-01 -0.658770  0.835645 -1.982701 -0.988242  NaN
2013-01-02 -1.508095  0.113650 -1.996918 -1.424770  1.0
2013-01-03  0.336551  1.684676 -0.364824 -1.327926  2.0
2013-01-04  0.038840 -0.517081 -0.205679 -1.243632  3.0
2013-01-05 -1.549272  1.780159 -0.165673  1.451983  4.0
2013-01-06 -1.954771  1.354079 -0.023719  0.893566  5.0

In [92]:
df.at[dates[0], "A"] = 0 # Setting values by label:

In [93]:
df.iat[0, 1] = 0 # Setting values by position:

In [94]:
df

                   A         B         C         D    F
2013-01-01  0.000000  0.000000 -1.982701 -0.988242  NaN
2013-01-02 -1.508095  0.113650 -1.996918 -1.424770  1.0
2013-01-03  0.336551  1.684676 -0.364824 -1.327926  2.0
2013-01-04  0.038840 -0.517081 -0.205679 -1.243632  3.0
2013-01-05 -1.549272  1.780159 -0.165673  1.451983  4.0
2013-01-06 -1.954771  1.354079 -0.023719  0.893566  5.0

In [95]:
df.loc[:, "D"] = np.array([5] * len(df)) # Setting by assigning with a NumPy array:

In [96]:
len(df)

6

In [97]:
df

                   A         B         C    D    F
2013-01-01  0.000000  0.000000 -1.982701  5.0  NaN
2013-01-02 -1.508095  0.113650 -1.996918  5.0  1.0
2013-01-03  0.336551  1.684676 -0.364824  5.0  2.0
2013-01-04  0.038840 -0.517081 -0.205679  5.0  3.0
2013-01-05 -1.549272  1.780159 -0.165673  5.0  4.0
2013-01-06 -1.954771  1.354079 -0.023719  5.0  5.0

In [98]:
# A where operation with setting

In [99]:
df2 = df.copy()

In [100]:
df2[df2 > 0] = -df2

In [101]:
df2

                   A         B         C    D    F
2013-01-01  0.000000  0.000000 -1.982701 -5.0  NaN
2013-01-02 -1.508095 -0.113650 -1.996918 -5.0 -1.0
2013-01-03 -0.336551 -1.684676 -0.364824 -5.0 -2.0
2013-01-04 -0.038840 -0.517081 -0.205679 -5.0 -3.0
2013-01-05 -1.549272 -1.780159 -0.165673 -5.0 -4.0
2013-01-06 -1.954771 -1.354079 -0.023719 -5.0 -5.0

In [102]:
# Miising data

In [103]:
df1 = df.reindex(index=dates[0:4], columns=list(df.columns) + ["E"])

In [105]:
df1.loc[dates[0] : dates[1] , "E"] = 1

In [106]:
df1

                   A         B         C    D    F    E
2013-01-01  0.000000  0.000000 -1.982701  5.0  NaN  1.0
2013-01-02 -1.508095  0.113650 -1.996918  5.0  1.0  1.0
2013-01-03  0.336551  1.684676 -0.364824  5.0  2.0  NaN
2013-01-04  0.038840 -0.517081 -0.205679  5.0  3.0  NaN

In [108]:
df # they jumped column called E in other dfs so we can add it in the newly df called df1

                   A         B         C    D    F
2013-01-01  0.000000  0.000000 -1.982701  5.0  NaN
2013-01-02 -1.508095  0.113650 -1.996918  5.0  1.0
2013-01-03  0.336551  1.684676 -0.364824  5.0  2.0
2013-01-04  0.038840 -0.517081 -0.205679  5.0  3.0
2013-01-05 -1.549272  1.780159 -0.165673  5.0  4.0
2013-01-06 -1.954771  1.354079 -0.023719  5.0  5.0

In [109]:
df1

                   A         B         C    D    F    E
2013-01-01  0.000000  0.000000 -1.982701  5.0  NaN  1.0
2013-01-02 -1.508095  0.113650 -1.996918  5.0  1.0  1.0
2013-01-03  0.336551  1.684676 -0.364824  5.0  2.0  NaN
2013-01-04  0.038840 -0.517081 -0.205679  5.0  3.0  NaN

In [110]:
df1.dropna(how="any") # drops any rows that have any

                   A        B         C    D    F    E
2013-01-02 -1.508095  0.11365 -1.996918  5.0  1.0  1.0

In [111]:
df1

                   A         B         C    D    F    E
2013-01-01  0.000000  0.000000 -1.982701  5.0  NaN  1.0
2013-01-02 -1.508095  0.113650 -1.996918  5.0  1.0  1.0
2013-01-03  0.336551  1.684676 -0.364824  5.0  2.0  NaN
2013-01-04  0.038840 -0.517081 -0.205679  5.0  3.0  NaN

In [113]:
df1.fillna(value=5) # fills missing data:

                   A         B         C    D    F    E
2013-01-01  0.000000  0.000000 -1.982701  5.0  5.0  1.0
2013-01-02 -1.508095  0.113650 -1.996918  5.0  1.0  1.0
2013-01-03  0.336551  1.684676 -0.364824  5.0  2.0  5.0
2013-01-04  0.038840 -0.517081 -0.205679  5.0  3.0  5.0

In [117]:
pd.isna(df1) # gets the boolean mask where values are nan:

                A      B      C      D      F      E
2013-01-01  False  False  False  False   True  False
2013-01-02  False  False  False  False  False  False
2013-01-03  False  False  False  False  False   True
2013-01-04  False  False  False  False  False   True

In [119]:
df1.isna()

                A      B      C      D      F      E
2013-01-01  False  False  False  False   True  False
2013-01-02  False  False  False  False  False  False
2013-01-03  False  False  False  False  False   True
2013-01-04  False  False  False  False  False   True

In [120]:
# Operations

In [121]:
df.mean()

A   -0.772791
B    0.735914
C   -0.789919
D    5.000000
F    3.000000
dtype: float64

In [122]:
df.mean(axis=1)

2013-01-01    0.754325
2013-01-02    0.521728
2013-01-03    1.731280
2013-01-04    1.463216
2013-01-05    1.813043
2013-01-06    1.875118
Freq: D, dtype: float64

In [124]:
s = pd.Series([1, 3, 5, np.nan, 6, 8], index=dates).shift(2)

In [125]:
s

2013-01-01    NaN
2013-01-02    NaN
2013-01-03    1.0
2013-01-04    3.0
2013-01-05    5.0
2013-01-06    NaN
Freq: D, dtype: float64

In [129]:
df.sub(s, axis="index") # I didn't understand what this is actually doing

                   A         B         C    D    F
2013-01-01       NaN       NaN       NaN  NaN  NaN
2013-01-02       NaN       NaN       NaN  NaN  NaN
2013-01-03 -0.663449  0.684676 -1.364824  4.0  1.0
2013-01-04 -2.961160 -3.517081 -3.205679  2.0  0.0
2013-01-05 -6.549272 -3.219841 -5.165673  0.0 -1.0
2013-01-06       NaN       NaN       NaN  NaN  NaN

In [128]:
df.sub(s, axis="index")

                   A         B         C    D    F
2013-01-01       NaN       NaN       NaN  NaN  NaN
2013-01-02       NaN       NaN       NaN  NaN  NaN
2013-01-03 -0.663449  0.684676 -1.364824  4.0  1.0
2013-01-04 -2.961160 -3.517081 -3.205679  2.0  0.0
2013-01-05 -6.549272 -3.219841 -5.165673  0.0 -1.0
2013-01-06       NaN       NaN       NaN  NaN  NaN

In [130]:
# user defined functions

In [132]:
df.agg(lambda x: np.mean(x) * 5.6)

A    -4.327630
B     4.121117
C    -4.423546
D    28.000000
F    16.800000
dtype: float64

In [133]:
df.transform(lambda x : x * 101.2)

                     A           B           C      D      F
2013-01-01    0.000000    0.000000 -200.649293  506.0    NaN
2013-01-02 -152.619196   11.501408 -202.088084  506.0  101.2
2013-01-03   34.058943  170.489174  -36.920232  506.0  202.4
2013-01-04    3.930656  -52.328631  -20.814714  506.0  303.6
2013-01-05 -156.786311  180.152057  -16.766068  506.0  404.8
2013-01-06 -197.822800  137.032843   -2.400409  506.0  506.0

In [134]:
# Value counts

In [138]:
s = pd.Series(np.random.randint(0, 7, size=10))

In [139]:
s.value_counts()

4    2
2    2
6    2
1    1
5    1
3    1
0    1
Name: count, dtype: int64

In [140]:
s

0    4
1    2
2    6
3    6
4    2
5    1
6    5
7    3
8    0
9    4
dtype: int64

In [143]:
s = pd.Series(["A", "B", "C", "Aaba", "Baca", np.nan, "CABA", "dog", "cat"])

In [144]:
s.str.lower()

0       a
1       b
2       c
3    aaba
4    baca
5     NaN
6    caba
7     dog
8     cat
dtype: object

In [145]:
# Merge

In [146]:
#concat

In [147]:
# concatinating pandas objects together row-wise with concat()

In [148]:
df = pd.DataFrame(np.random.randn(10, 4))

In [149]:
df

          0         1         2         3
0 -0.237783  0.108854 -0.991454  0.701300
1 -1.065391 -2.443477  1.103271  1.105507
2  0.329855 -0.260363 -0.186935  1.032059
3 -0.653316 -0.315509  1.363053  0.901960
4  0.335079 -0.836873 -1.452349 -0.745874
5 -1.349544  0.765819 -0.781412 -1.042593
6  0.983679  0.046933  0.222973 -2.073776
7 -0.601085  0.815661 -1.183999  0.171809
8  0.796084 -0.336281 -0.696102 -0.393122
9  1.128779 -1.118698 -0.328926 -0.982047

In [150]:
# break it into pieces

In [151]:
pieces = [df[:3], df[3:7], df[7:]]

In [152]:
pieces

[          0         1         2         3
 0 -0.237783  0.108854 -0.991454  0.701300
 1 -1.065391 -2.443477  1.103271  1.105507
 2  0.329855 -0.260363 -0.186935  1.032059,
           0         1         2         3
 3 -0.653316 -0.315509  1.363053  0.901960
 4  0.335079 -0.836873 -1.452349 -0.745874
 5 -1.349544  0.765819 -0.781412 -1.042593
 6  0.983679  0.046933  0.222973 -2.073776,
           0         1         2         3
 7 -0.601085  0.815661 -1.183999  0.171809
 8  0.796084 -0.336281 -0.696102 -0.393122
 9  1.128779 -1.118698 -0.328926 -0.982047]

In [154]:
pd.concat(pieces)

          0         1         2         3
0 -0.237783  0.108854 -0.991454  0.701300
1 -1.065391 -2.443477  1.103271  1.105507
2  0.329855 -0.260363 -0.186935  1.032059
3 -0.653316 -0.315509  1.363053  0.901960
4  0.335079 -0.836873 -1.452349 -0.745874
5 -1.349544  0.765819 -0.781412 -1.042593
6  0.983679  0.046933  0.222973 -2.073776
7 -0.601085  0.815661 -1.183999  0.171809
8  0.796084 -0.336281 -0.696102 -0.393122
9  1.128779 -1.118698 -0.328926 -0.982047

In [155]:
# join

In [156]:
left = pd.DataFrame({"key": ["foo", "foo"], "lval": [1, 2]})

In [157]:
right = pd.DataFrame({"key": ["foo", "foo"], "rval": [4, 5]})

In [158]:
left

   key  lval
0  foo     1
1  foo     2

In [159]:
right

   key  rval
0  foo     4
1  foo     5

In [160]:
pd.merge(left, right, on = "key")

   key  lval  rval
0  foo     1     4
1  foo     1     5
2  foo     2     4
3  foo     2     5

In [161]:
# merge on unique keys

In [162]:
left = pd.DataFrame({"key": ["foo", "bar"], "lvar": [1,2]})

In [163]:
right = pd.DataFrame({"key": ["foo", "bar"], "rval":[4, 5]})

In [164]:
left

   key  lvar
0  foo     1
1  bar     2

In [165]:
right

   key  rval
0  foo     4
1  bar     5

In [166]:
pd.merge(left, right, on="key")

   key  lvar  rval
0  foo     1     4
1  bar     2     5

In [167]:
# Grouping

In [168]:
df = pd.DataFrame({
    "A":["foo", "bar", "foo", "bar", "foo", "bar", "foo", "foo"], 
    "B": ["one", "one", "two", "three", "two", "two", "one", "three"],

    "C": np.random.randn(8),

    "D": np.random.randn(8),
})

In [169]:
df

     A      B         C         D
0  foo    one -0.288729  0.181690
1  bar    one -0.249769  0.290933
2  foo    two  0.121522  0.377950
3  bar  three  0.124576  1.142568
4  foo    two  0.551591 -0.890314
5  bar    two -0.163744  1.553828
6  foo    one -0.407574 -1.789340
7  foo  three -0.315505 -0.650282

In [170]:
# Grouping by a column label, selecting column labels, and then applying the DataFrameGroupBy.sum() function to the resulting groups:

In [171]:
df.groupby("A")[["C", "D"]].sum()

            C         D
A
bar -0.288937  2.987329
foo -0.338695 -2.770295

In [172]:
# Grouping by multiple columns label forms MultiIndex.

In [175]:
df.groupby(["A", "B"]).sum()

                  C         D
A   B
bar one   -0.249769  0.290933
    three  0.124576  1.142568
    two   -0.163744  1.553828
foo one   -0.696303 -1.607650
    three -0.315505 -0.650282
    two    0.673113 -0.512364

In [176]:
# Reshaping

In [177]:
arrays = [

   ["bar", "bar", "baz", "baz", "foo", "foo", "qux", "qux"],

   ["one", "two", "one", "two", "one", "two", "one", "two"],

]

In [178]:
index = pd.MultiIndex.from_arrays(arrays, names=["first", "second"])

In [179]:
df = pd.DataFrame(np.random.randn(8, 2), index=index, columns=["A", "B"])

In [180]:
index

MultiIndex([('bar', 'one'),
            ('bar', 'two'),
            ('baz', 'one'),
            ('baz', 'two'),
            ('foo', 'one'),
            ('foo', 'two'),
            ('qux', 'one'),
            ('qux', 'two')],
           names=['first', 'second'])

In [181]:
df

                     A         B
first second
bar   one     1.996799  0.235898
      two     0.445800 -0.429429
baz   one     0.024976 -0.027593
      two    -1.961657  2.098371
foo   one    -0.173739 -0.088973
      two    -1.074313 -1.204144
qux   one    -0.449216  2.558431
      two     1.478473 -2.591601

In [182]:
df2 = df[:4]

In [183]:
df2

                     A         B
first second
bar   one     1.996799  0.235898
      two     0.445800 -0.429429
baz   one     0.024976 -0.027593
      two    -1.961657  2.098371

In [184]:
# The stack() method compresses a level in the DataFrames columns:

In [185]:
stacked = df2.stack(future_stack=True)

In [187]:
stacked

first  second
bar    one     A    1.996799
               B    0.235898
       two     A    0.445800
               B   -0.429429
baz    one     A    0.024976
               B   -0.027593
       two     A   -1.961657
               B    2.098371
dtype: float64

In [188]:
# With a stacked DataFrame or Series (having a MultiIndex as the index), the inverse operation of stack() is unstack(), which by default unstacks the last level:

In [189]:
stacked.unstack()

                     A         B
first second
bar   one     1.996799  0.235898
      two     0.445800 -0.429429
baz   one     0.024976 -0.027593
      two    -1.961657  2.098371

In [190]:
stacked.unstack(1)

second        one       two
first
bar   A  1.996799  0.445800
      B  0.235898 -0.429429
baz   A  0.024976 -1.961657
      B -0.027593  2.098371

In [191]:
stacked.unstack(0)

first          bar       baz
second
one    A  1.996799  0.024976
       B  0.235898 -0.027593
two    A  0.445800 -1.961657
       B -0.429429  2.098371

In [192]:
# Pivot tables

In [193]:
df = pd.DataFrame(
    {
        
        "A": ["one", "one", "two", "three"] * 3,

        "B": ["A", "B", "C"] * 4,

        "C": ["foo", "foo", "foo", "bar", "bar", "bar"] * 2,

        "D": np.random.randn(12),

        "E": np.random.randn(12),
    }
)

In [194]:
df

        A  B    C         D         E
0     one  A  foo  0.842085  0.150718
1     one  B  foo -0.093201  0.363643
2     two  C  foo -1.704734 -0.105295
3   three  A  bar -1.085132 -0.010531
4     one  B  bar  0.830154  0.559692
5     one  C  bar  0.879337 -0.575923
6     two  A  foo -1.275319  0.101946
7   three  B  foo  1.471691 -0.297435
8     one  C  foo  2.055042  0.382027
9     one  A  bar -0.284774 -2.261038
10    two  B  bar  1.461674 -0.849523
11  three  C  bar -0.056496 -1.356473

In [195]:
# pivot_table() pivots a DataFrame specifying the values, index and columns

In [196]:
pd.pivot_table(df, values="D", index=["A", "B"], columns=["C"])

C             bar       foo
A     B
one   A -0.284774  0.842085
      B  0.830154 -0.093201
      C  0.879337  2.055042
three A -1.085132       NaN
      B       NaN  1.471691
      C -0.056496       NaN
two   A       NaN -1.275319
      B  1.461674       NaN
      C       NaN -1.704734

In [197]:
# Time series

In [5]:
rng = pd.date_range("1/1/2012", periods=100, freq="s")

In [8]:
ts = pd.Series(np.random.randint(0, 500, len(rng)), index=rng)

In [9]:
rng

DatetimeIndex(['2012-01-01 00:00:00', '2012-01-01 00:00:01',
               '2012-01-01 00:00:02', '2012-01-01 00:00:03',
               '2012-01-01 00:00:04', '2012-01-01 00:00:05',
               '2012-01-01 00:00:06', '2012-01-01 00:00:07',
               '2012-01-01 00:00:08', '2012-01-01 00:00:09',
               '2012-01-01 00:00:10', '2012-01-01 00:00:11',
               '2012-01-01 00:00:12', '2012-01-01 00:00:13',
               '2012-01-01 00:00:14', '2012-01-01 00:00:15',
               '2012-01-01 00:00:16', '2012-01-01 00:00:17',
               '2012-01-01 00:00:18', '2012-01-01 00:00:19',
               '2012-01-01 00:00:20', '2012-01-01 00:00:21',
               '2012-01-01 00:00:22', '2012-01-01 00:00:23',
               '2012-01-01 00:00:24', '2012-01-01 00:00:25',
               '2012-01-01 00:00:26', '2012-01-01 00:00:27',
               '2012-01-01 00:00:28', '2012-01-01 00:00:29',
               '2012-01-01 00:00:30', '2012-01-01 00:00:31',
               '2012-01-01 00:00:32', '2012-01-01 00:00:33',
               '2012-01-01 00:00:34', '2012-01-01 00:00:35',
               '2012-01-01 00:00:36', '2012-01-01 00:00:37',
               '2012-01-01 00:00:38', '2012-01-01 00:00:39',
               '2012-01-01 00:00:40', '2012-01-01 00:00:41',
               '2012-01-01 00:00:42', '2012-01-01 00:00:43',
               '2012-01-01 00:00:44', '2012-01-01 00:00:45',
               '2012-01-01 00:00:46', '2012-01-01 00:00:47',
               '2012-01-01 00:00:48', '2012-01-01 00:00:49',
               '2012-01-01 00:00:50', '2012-01-01 00:00:51',
               '2012-01-01 00:00:52', '2012-01-01 00:00:53',
               '2012-01-01 00:00:54', '2012-01-01 00:00:55',
               '2012-01-01 00:00:56', '2012-01-01 00:00:57',
               '2012-01-01 00:00:58', '2012-01-01 00:00:59',
               '2012-01-01 00:01:00', '2012-01-01 00:01:01',
               '2012-01-01 00:01:02', '2012-01-01 00:01:03',
               '2012-01-01 00:01:04', '2012-01-01 00:01:05',
               '2012-01-01 00:01:06', '2012-01-01 00:01:07',
               '2012-01-01 00:01:08', '2012-01-01 00:01:09',
               '2012-01-01 00:01:10', '2012-01-01 00:01:11',
               '2012-01-01 00:01:12', '2012-01-01 00:01:13',
               '2012-01-01 00:01:14', '2012-01-01 00:01:15',
               '2012-01-01 00:01:16', '2012-01-01 00:01:17',
               '2012-01-01 00:01:18', '2012-01-01 00:01:19',
               '2012-01-01 00:01:20', '2012-01-01 00:01:21',
               '2012-01-01 00:01:22', '2012-01-01 00:01:23',
               '2012-01-01 00:01:24', '2012-01-01 00:01:25',
               '2012-01-01 00:01:26', '2012-01-01 00:01:27',
               '2012-01-01 00:01:28', '2012-01-01 00:01:29',
               '2012-01-01 00:01:30', '2012-01-01 00:01:31',
               '2012-01-01 00:01:32', '2012-01-01 00:01:33',
               '2012-01-01 00:01:34', '2012-01-01 00:01:35',
               '2012-01-01 00:01:36', '2012-01-01 00:01:37',
               '2012-01-01 00:01:38', '2012-01-01 00:01:39'],
              dtype='datetime64[ns]', freq='s')

In [10]:
ts

2012-01-01 00:00:00     13
2012-01-01 00:00:01    418
2012-01-01 00:00:02     89
2012-01-01 00:00:03    460
2012-01-01 00:00:04    214
                      ...
2012-01-01 00:01:35    205
2012-01-01 00:01:36    350
2012-01-01 00:01:37     77
2012-01-01 00:01:38     17
2012-01-01 00:01:39    125
Freq: s, Length: 100, dtype: int64

In [11]:
ts.resample("5Min").sum()

2012-01-01    22129
Freq: 5min, dtype: int64

In [12]:
rng = pd.date_range("3/6/2012 00:00", periods = 5, freq="D")

In [19]:
ts = pd.Series(np.random.randn(len(rng)), rng) # ts means a time series which means a serie of time

In [14]:
rng

DatetimeIndex(['2012-03-06', '2012-03-07', '2012-03-08', '2012-03-09',
               '2012-03-10'],
              dtype='datetime64[ns]', freq='D')

In [15]:
ts

2012-03-06   -1.768906
2012-03-07   -0.476403
2012-03-08   -0.586294
2012-03-09    0.295778
2012-03-10    0.345857
Freq: D, dtype: float64

In [18]:
ts_utc = ts.tz_localize("UTC") # localizes a time series to a time zone:

In [17]:
ts_utc

2012-03-06 00:00:00+00:00   -1.768906
2012-03-07 00:00:00+00:00   -0.476403
2012-03-08 00:00:00+00:00   -0.586294
2012-03-09 00:00:00+00:00    0.295778
2012-03-10 00:00:00+00:00    0.345857
Freq: D, dtype: float64

In [20]:
# Series.tz_convert() converts a timezones aware time series to another time zone:

In [21]:
ts_utc.tz_convert("US/Eastern")

2012-03-05 19:00:00-05:00   -1.768906
2012-03-06 19:00:00-05:00   -0.476403
2012-03-07 19:00:00-05:00   -0.586294
2012-03-08 19:00:00-05:00    0.295778
2012-03-09 19:00:00-05:00    0.345857
Freq: D, dtype: float64

In [22]:
# Adding a non-fixed duration (BusinessDay) to a time series:

In [23]:
rng + pd.offsets.BusinessDay(5)

DatetimeIndex(['2012-03-13', '2012-03-14', '2012-03-15', '2012-03-16',
               '2012-03-16'],
              dtype='datetime64[ns]', freq=None)

In [24]:
rng

DatetimeIndex(['2012-03-06', '2012-03-07', '2012-03-08', '2012-03-09',
               '2012-03-10'],
              dtype='datetime64[ns]', freq='D')

In [25]:
# Categoricals

In [26]:
df = pd.DataFrame({
    "id":[1, 2, 3, 4, 5, 6], "raw_grade":["a", "b", "b", "a", "a", "e"]
})